{
    "buckets": [
        {
            "Name": "main",
            "Source": "https://github.com/ScoopInstaller/Main.git",
            "Updated": "2025-11-14T20:29:36-08:00",
            "Manifests": 1410
        },
        {
            "Name": "extras",
            "Source": "https://github.com/ScoopInstaller/Extras",
            "Updated": "2025-11-14T20:29:22-08:00",
            "Manifests": 2208
        },
        {
            "Name": "versions",
            "Source": "https://github.com/ScoopInstaller/Versions",
            "Updated": "2025-11-14T20:39:17-08:00",
            "Manifests": 534
        },
        {
            "Name": "nerd-fonts",
            "Source": "https://github.com/matthewjberger/scoop-nerd-fonts",
            "Updated": "2025-11-08T06:20:17-08:00",
            "Manifests": 367
        }
    ],
    "apps": [
        {
            "Updated": "2025-11-14T12:55:32.7590432-08:00",
            "Version": "2.32.0",
            "Name": "1password-cli",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-08-16T23:28:16.0735515-07:00",
            "Version": "25.01",
            "Name": "7zip",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:44.7864194-08:00",
            "Version": "0.26.0",
            "Name": "bat",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T21:19:08.0538251-08:00",
            "Version": "1.0.5",
            "Name": "btop",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:58.7625431-08:00",
            "Version": "2025-09-09",
            "Name": "cacert",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-12T14:19:26.8798355-08:00",
            "Version": "3.4.0",
            "Name": "CascadiaCode-NF",
            "Info": "",
            "Source": "nerd-fonts"
        },
        {
            "Updated": "2025-11-12T23:52:55.7007902-08:00",
            "Version": "2.67.0",
            "Name": "chezmoi",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:57.7930705-08:00",
            "Version": "8.16.0_14",
            "Name": "curl",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-14T21:10:01.5156866-08:00",
            "Version": "2.934",
            "Name": "cygwin",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:49.3552828-08:00",
            "Version": "0.18.2",
            "Name": "delta",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:02:53.320986-08:00",
            "Version": "1.4.4",
            "Name": "diff-so-fancy",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-04T22:49:33.6144328-08:00",
            "Version": "0.23.4",
            "Name": "eza",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:45.6161449-08:00",
            "Version": "10.3.0",
            "Name": "fd",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-12T14:19:21.0453422-08:00",
            "Version": "3.4.0",
            "Name": "FiraCode-NF",
            "Info": "",
            "Source": "nerd-fonts"
        },
        {
            "Updated": "2025-08-16T23:28:31.3960087-07:00",
            "Version": "0.65.1",
            "Name": "fzf",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:51.5205159-08:00",
            "Version": "2.82.1",
            "Name": "gh",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-06T00:46:04.9878712-08:00",
            "Version": "2.51.2",
            "Name": "git-with-openssh",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:48.5682555-08:00",
            "Version": "2.6.1",
            "Name": "gsudo",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-12T14:19:21.8344791-08:00",
            "Version": "3.4.0",
            "Name": "Hack-NF",
            "Info": "",
            "Source": "nerd-fonts"
        },
        {
            "Updated": "2025-11-12T14:19:25.0887507-08:00",
            "Version": "3.4.0",
            "Name": "JetBrainsMono-NF",
            "Info": "",
            "Source": "nerd-fonts"
        },
        {
            "Updated": "2025-11-05T13:18:53.2292736-08:00",
            "Version": "1.8.1",
            "Name": "jq",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-12T14:19:09.2181244-08:00",
            "Version": "0.56.0",
            "Name": "lazygit",
            "Info": "",
            "Source": "extras"
        },
        {
            "Updated": "2025-11-05T13:18:52.7899729-08:00",
            "Version": "4.4.1",
            "Name": "make",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:42.0393508-08:00",
            "Version": "2025.11.2",
            "Name": "mise",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:35.4324252-08:00",
            "Version": "0.11.5",
            "Name": "neovim",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-03T17:05:20.3010966-08:00",
            "Version": "1.2.2",
            "Name": "nvm",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-08-16T23:34:18.4172865-07:00",
            "Version": "8.4.11",
            "Name": "php",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:39.2642283-08:00",
            "Version": "7.5.4",
            "Name": "pwsh",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:43.2075088-08:00",
            "Version": "15.1.0",
            "Name": "ripgrep",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-06-10T18:27:48.663329-07:00",
            "Version": "2.1.0",
            "Name": "scoop-search",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:40.750412-08:00",
            "Version": "1.24.0",
            "Name": "starship",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-04T22:49:34.1907914-08:00",
            "Version": "0.10.1",
            "Name": "vivid",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:19:01.2734324-08:00",
            "Version": "1.21.4",
            "Name": "wget",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:53.8670188-08:00",
            "Version": "4.48.1",
            "Name": "yq",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-12T09:36:41.266558-08:00",
            "Version": "0.15.2",
            "Name": "zig",
            "Info": "",
            "Source": "main"
        },
        {
            "Updated": "2025-11-05T13:18:46.2911897-08:00",
            "Version": "0.9.8",
            "Name": "zoxide",
            "Info": "",
            "Source": "main"
        }
    ]
}
